In [18]:
import pandas as pd

# DataFrame
- 2차원 배열
- 행과 열로 구성

In [19]:
# Dictionary를 이용한 DataFrame 생성
dict_data = {'c0':[1,2,3] , 'c1':[4,5,6] , 'c2':[7,8,9] , 'c3':[10,11,12] , 'c4':[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [20]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [21]:
# List를 이용한 DataFrame 생성
df = pd.DataFrame(
    [[15,'남','덕영중'],
    [17,'여','수리중']],
    index=['준서','예은'],
    columns=['나이','성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [22]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [23]:
# 행 인덱스, 열 이름 변경하기 - 1
df.index = ['학생1','학생2']
df.columns = ['연령','남녀','소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [24]:
df = pd.DataFrame(
    [[15,'남','덕영중'],
    [17,'여','수리중']],
    index=['준서','예은'],
    columns=['나이','성별','학교']
)
df

df.rename(columns={'나이':'연령', '성별':'남녀' , '학교':'소속'} , inplace=True) # 컬럼을 지정해서 바꾸기! 모든 컬럼을 안써줘도 된다 / inplace = True 바로 적용하겠다

df

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

In [25]:
# 행 이름 변경하기
# df 의 행 인덱스 중에서, '준서'를 '학생1'로 , '예은'을 '학생2'로 바꾸기
df.rename(index={'준서':'학생1','예은':'학생2'}, inplace=True)
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [26]:
data = pd.DataFrame(
    {
        '수학':[90,80,70],
        '영어':[98,89,95],
        '음악':[85,95,100],
        '체육':[100,90,90]

    },
    index=['서준','우현','인아']
)
data

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

## 행 삭제

In [27]:
df2 = data.copy()

In [28]:
# df2의 index가 우현인 1개 행을 삭제한다
# df2.drop('우현' , inplace=True)
df2.drop('우현' , axis=0 , inplace=True) # axis = 0 이 기본값, axis 를 써주는게 좋다
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [29]:
df3 = data.copy()

In [30]:
# df3의 index가 우현과 인아인 2개 행을 삭제 
df3.drop(['우현','인아'] , axis=0 , inplace=True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

## 열 삭제

In [31]:
df4 = data.copy()

In [32]:
# df4 의 수학 1개 열을 삭제
df4.drop('수학' , axis=1, inplace=True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [33]:
df5 = data.copy()

# df5의 영어와 음악 2개 열을 삭제
df5.drop(['영어','음악'] , axis='columns', inplace=True) # 'rows' / 'columns'로도 사용 가능
df5

    수학   체육
서준  90  100
우현  80   90
인아  70   90

---

### 행선택
- index 이름을 기준으로 선택할 경우에는 loc
- 정수형 위치 index를 사용할 경우에는 iloc

In [35]:
df = data.copy()

In [36]:
# index가 서준인 행을 선택
print(df.loc['서준'])
print("")
print(df.iloc[0])

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [37]:
# 행 인덱스를 사용하여 서준과 우현 2개의 행을 선택
# loc
print(df.loc[['서준','우현']])
# iloc
print(df.iloc[0:2])

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [40]:
print(df['수학'])
print(df.수학)

서준    90
우현    80
인아    70
Name: 수학, dtype: int64
서준    90
우현    80
인아    70
Name: 수학, dtype: int64

### 범위 Slicing 활용
- dataFrame.iloc[시작 index : 끝index : 증가치]

In [44]:
print(df.iloc[::2]) # 처음부터 끝까지 2 간격으로 
print(df.iloc[0:3:2])

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90
    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [43]:
df.iloc[::-1] # -1 파이썬에서는 뒤에서 방향 / R 에서는 삭제

    수학  영어   음악   체육
인아  70  95  100   90
우현  80  89   95   90
서준  90  98   85  100

# 행과 열을 이용한 데이터 선택

In [49]:
df = pd.DataFrame(
    {
        '수학':[90,80,70],
        '영어':[98,89,95],
        '음악':[85,95,100],
        '체육':[100,90,90],
        '이름':['서준','우현','인아']
    },
)
df

   수학  영어   음악   체육  이름
0  90  98   85  100  서준
1  80  89   95   90  우현
2  70  95  100   90  인아

In [50]:
# index이름을 정하기
# 지정 컬럼을 인덱스로 쓸거야!
df.set_index('이름' , inplace= True)
df # 조건을 걸었을때도 인덱스가 같이 보이기 때문에 이렇게 설정해주는것의 장점

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [56]:
print(df.loc['서준', ['음악','체육']])
print(df.iloc[0,[2,3]])
print(df.iloc[0, 2:4])
print(df.loc['서준','음악':'체육'])
print(df.loc['서준','음악':]) # 체육이 끝 컬럼이라서 안써도 됨
print(df.iloc[0, 2:]) # 체육이 끝 컬럼이라서 안써도 됨

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

In [57]:
# 열 추가
df['국어'] = 80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [60]:
# 행 추가
df.loc['철수'] = [10, 20, 30, 40, 50]
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
철수  10  20   30   40  50

In [61]:
df.loc['영희'] = df.loc['인아']
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
철수  10  20   30   40  50
영희  70  95  100   90  80

In [68]:
# 서준의 체육 점수를 80점으로 변경하기
df.loc['서준' , '체육'] = 80
df.iloc[0 , 3] = 80
df

    수학  영어   음악  체육  국어
이름
서준  90  98   85  80  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [82]:
# 서준의 음악과 체육점수를 50점으로 변경하기
df.loc['서준',['음악','체육']] = 50
df.loc['서준', '음악':'체육'] = 50
df.iloc[0, [2,3]] = 50
df.iloc[0, 2:4] = 50
df

    수학  영어   음악  체육  국어
이름
서준  90  98   50  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [86]:
# 서준의 음악 점수를 100점 체육점수를 50점으로 변경하기
df.loc['서준',['음악','체육']] = [100 , 50]
df.loc['서준', '음악':'체육'] = (100, 50) # 100, 50 으로 써도 됨 , 아무것도 없으면 튜플
df.iloc[0, [2,3]] = [100,50]
df.iloc[0, 2:4] = 100, 50
df

    수학  영어   음악  체육  국어
이름
서준  90  98  100  50  80
우현  80  89   95  90  80
인아  70  95  100  90  80
철수  10  20   30  40  50
영희  70  95  100  90  80

In [90]:
# 행열 변환 방법
print(df.transpose())
print("-")
print(df.T)

이름   서준  우현   인아  철수   영희
수학   90  80   70  10   70
영어   98  89   95  20   95
음악  100  95  100  30  100
체육   50  90   90  40   90
국어   80  80   80  50   80
-
이름   서준  우현   인아  철수   영희
수학   90  80   70  10   70
영어   98  89   95  20   95
음악  100  95  100  30  100
체육   50  90   90  40   90
국어   80  80   80  50   80

In [91]:
df = pd.DataFrame(
    {
        'c0':[1,2,3],
        'c1':[4,5,6],
        'c2':[7,8,9],
        'c3':[10,11,12],
        'c4':[13,14,15]
    },
    index = ['r0','r1','r2'],
)
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [94]:
# 인덱스를 재 설정하기
new_index = ['r0','r1','r2','r3','r4']
ndf = df.reindex(new_index ) # NaN값으로 들어감
print(ndf)
ndf = df.reindex(new_index , fill_value= 0) # NaN값을 0 으로 채움
print(ndf)

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN
    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [97]:
ndf = df.reset_index() # 초기화, 기존 인덱스가 컬럼으로 들어감 
ndf

  index  c0  c1  c2  c3  c4
0    r0   1   4   7  10  13
1    r1   2   5   8  11  14
2    r2   3   6   9  12  15

In [99]:
# 내림차순으로 행 인덱스 정렬
df.sort_index(ascending=False)

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [101]:
# 특정 값을 기준으로 정렬하기
df.sort_values(by='c1', ascending=False, inplace=True)
df

    c0  c1  c2  c3  c4
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

# DataFrame 연산

In [102]:
import seaborn as sns

In [108]:
titanic = sns.load_dataset('titanic')
print(titanic.head())
print(titanic.tail())
# class컬럼 까지 정도가 R에서 했던 데이터 그 뒤로는 유추해낸 + a 컬럼들
# 특성 공학 : column Engineering ; 기존 컬럼으로 새로운 컬럼을 유추해내는 것

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True
     survived  pclass     sex   age  sibsp  parch   fare embarked   class  \
886         0       2    male  27.0      0      0  13.00        S  Second
887         1       1  female  19.0      0      0  30.00        S   First
888         0       3  female   NaN      1      2  23.45        S   Third
889         1       1    male  26.0      0      0  30.00        C   First
890         0       3    male  32.0      0      0   7.75        Q   Third

       who  adult_male deck  embark_town alive  alone
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

In [109]:
# titanic 에서 age와 fare부분의 컬럼만 발췌하여 df 라는 dataFrame 만들기
df = titanic[['age','fare']]
df = titanic.loc[:, ['age','fare']]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [110]:
# 평균 등등 볼 수 있음
df.describe()

              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [120]:
# 모든 컬럼에 10씩 증가하여 addition이라는 DataFrame 생성하기
addition = df + 10
print(addition.head())
print(addition.tail())
addition.describe()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500
      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75

              age        fare
count  714.000000  891.000000
mean    39.699118   42.204208
std     14.526497   49.693429
min     10.420000   10.000000
25%     30.125000   17.910400
50%     38.000000   24.454200
75%     48.000000   41.000000
max     90.000000  522.329200

In [122]:
# addition 과 df 의 차를 구하여 subtraction이라는 DataFrame 만들기
subtraction = addition - df
subtraction

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]

---